//push, pop, shift, unshift

//push (การนำสมาชิกเข้าไปเพิ่มใน Array โดยให้ต่อท้าย)
const data = [10, 20, 30]
    //push แบบปกติ

// data.push(500)
// console.log(data)
//[ 10, 20, 30, 500 ]

//push แบบอาเรย์

//data.push([500, 1000, 2000])
//[ 10, 20, 30, 500, [ 500, 1000, 2000 ] ]

data.push(...[500, 1000, 2000])
    //[ 10, 20, 30, 500, 1000, 2000 ]
console.log(data)

//pop (เป็นการนำเอาสมาชิกที่อยู่ท้ายสุด ออกไปจาก array)

data.pop()
console.log(data)

//[ 10, 20, 30, 500, 1000, 2000 ]
//[ 10, 20, 30, 500, 1000 ]

//----------------------------------------------------

//shift, unshift (จะทำงานกับข้อมูลที่อยู่ด้านหน้า)

//shift (จะทำการลบสามชิก array ที่อยู่ข้างหน้าออกไป)

data.shift()
console.log(data)

// [ 10, 20, 30, 500, 1000, 2000 ]
// [ 10, 20, 30, 500, 1000 ]
// [ 20, 30, 500, 1000 ]

//unshift (การเพิ่มข้อมูลสามชิก array ไว้ด้านหน้า)

data.unshift(...[999])
console.log(data)

// [ 10, 20, 30, 500, 1000, 2000 ]
// [ 10, 20, 30, 500, 1000 ]
// [ 20, 30, 500, 1000 ]
// [ 999, 20, 30, 500, 1000 ]